In [26]:
import pandas as pd
import numpy as np

# Creating a Dataframe from an Array

#### option 1

In [27]:
# creating an array
data = np.array([[1,4], [2,6], [1,9]])
data

array([[1, 4],
       [2, 6],
       [1, 9]])

In [28]:
# creating a dataframe
pd.DataFrame(data)

   0  1
0  1  4
1  2  6
2  1  9

In [29]:
df = pd.DataFrame(data, index = ["row1", "row2", "row3"], 
            columns = ["col1", "col2"])
df

      col1  col2
row1     1     4
row2     2     6
row3     1     9

#### option 2

In [30]:
data = [[1,4], [2,6], [1,9]]

In [31]:
df = pd.DataFrame(data, index = ["row1", "row2", "row3"], 
            columns = ["col1", "col2"])
df

      col1  col2
row1     1     4
row2     2     6
row3     1     9

# Creating Dataframe from a Dictionary

In [32]:
states = ["California", "Texas", "Florida", "New York"]
population = [38472937, 23847923, 1273899, 12378888]

In [33]:
dictStates = {"States":states, "Population":population}

In [34]:
dfPopulation = pd.DataFrame(dictStates)

In [35]:
dfPopulation

       States  Population
0  California    38472937
1       Texas    23847923
2     Florida     1273899
3    New York    12378888

# Creating Dataframe from a CSV file

In [38]:
animals = pd.read_csv("StudentsPerformance.csv")

In [41]:
animals.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75